package main

import "fmt"

func main() {
	var a, b int
	var operator string
	fmt.Println("a: ")
	fmt.Scan(&a)
	fmt.Println("b: ")
	fmt.Scan(&b)
	fmt.Println("operator: ")
	fmt.Scan(&operator)
	// Используя логические конструкции `if/else` или `switch`
	// имплементируйте логику вызова соответствующей функции
	// в зависимости от значения переменной `operator`.
	// Если введенный пользователем оператор неизвестен,
	// то вывести сообщение "Неизвестный оператор".
	var result int
	// ПИШЕМ КОД ТУТ
	if 
	fmt.Printf("%d %s %d = %d", a, operator, b, result)
}

// Ниже этой строчки имплементируйте функцию `Add`,
// которая выполняет произведение двух чисел и возвращает результат
// Ниже этой строчки имплементируйте функцию `Subtract`,
// которая выполняет вычитание двух чисел и возвращает результат
// Ниже этой строчки имплементируйте функцию `Multiply`,
// которая выполняет произведение двух чисел и возвращает результат
// Ниже этой строчки имплементируйте функцию `Divide`,
// которая выполняет деление двух чисел и возвращает результат
